StijnCrul/RTOS_I2C_Test/Generated_Source/PSoC6/DMA_ADC.h
/***************************************
*    Global Variables
***************************************/
extern uint8_t DMA_ADC_initVar;

extern const cy_stc_dma_descriptor_config_t DMA_ADC_Descriptor_1_config;
extern cy_stc_dma_descriptor_t DMA_ADC_Descriptor_1;

extern const cy_stc_dma_descriptor_config_t DMA_ADC_Descriptor_2_config;
extern cy_stc_dma_descriptor_t DMA_ADC_Descriptor_2;

extern const cy_stc_dma_descriptor_config_t DMA_ADC_Descriptor_3_config;
extern cy_stc_dma_descriptor_t DMA_ADC_Descriptor_3;

extern const cy_stc_dma_descriptor_config_t DMA_ADC_Descriptor_4_config;
extern cy_stc_dma_descriptor_t DMA_ADC_Descriptor_4;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: DMA_ADC_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_Stop(void)
{
    Cy_DMA_Channel_Disable(DMA_ADC_HW, DMA_ADC_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_ADC_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(DMA_ADC_HW, DMA_ADC_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_ADC_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(DMA_ADC_HW, DMA_ADC_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_ADC_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(DMA_ADC_HW, DMA_ADC_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: DMA_ADC_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA_ADC_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(DMA_ADC_HW, DMA_ADC_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_ADC_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA_ADC_HW, DMA_ADC_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: DMA_ADC_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA_ADC_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA_ADC_HW, DMA_ADC_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: DMA_ADC_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(DMA_ADC_HW, DMA_ADC_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: DMA_ADC_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_ADC_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(DMA_ADC_HW, DMA_ADC_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_ADC_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: DMA_ADC_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * DMA_ADC_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


