StijnCrul/RTOS_I2C_Test/Generated_Source/PSoC6/DMA_ADC.h
/*******************************************************************************
* Function Name: DMA_ADC_GetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_ADC_GetInterruptMask(void)
{
    return (Cy_DMA_Channel_GetInterruptMask(DMA_ADC_HW, DMA_ADC_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_ADC_SetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_SetInterruptMask(uint32_t interrupt)
{
    Cy_DMA_Channel_SetInterruptMask(DMA_ADC_HW, DMA_ADC_DW_CHANNEL, interrupt);
}


/*******************************************************************************
* Function Name: DMA_ADC_GetInterruptStatusMasked
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptStatusMasked() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_ADC_GetInterruptStatusMasked(void)
{
    return (Cy_DMA_Channel_GetInterruptStatusMasked(DMA_ADC_HW, DMA_ADC_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_ADC_Trigger
****************************************************************************//**
*
* Invokes the Cy_TrigMux_SwTrigger() PDL driver function.
*
* \param cycles
*  The number of "Clk_Peri" cycles during which the trigger remains activated.
*  The valid range of cycles is 1 ... 254.
*  Also there are special values:
*  CY_TRIGGER_INFINITE - trigger remains activated untill user deactivates it by
*  calling this function with CY_TRIGGER_DEACTIVATE parameter.
*  CY_TRIGGER_DEACTIVATE - it is used to deactivate the trigger activated by
*  calling this function with CY_TRIGGER_INFINITE parameter.
*  Note: the DMA is clocked by "Clk_Slow" which can be slower than "Clk_Peri".
* 
* \return A status:
* - CY_TRIGMUX_SUCCESS: The trigger is succesfully activated/deactivated.
* - CY_TRIGMUX_INVALID_STATE: The trigger is already activated/not active.
*
*******************************************************************************/
__STATIC_INLINE cy_en_trigmux_status_t DMA_ADC_Trigger(uint32_t cycles)
{
    return (Cy_TrigMux_SwTrigger((uint32_t)DMA_ADC_DW__TR_IN, cycles));
}


#if(CY_DMA_BWC)
/* Definitions to support backward compatibility with the component version 1.0, 
*  they are strongly not recommended to use in new designs */

#define DMA_ADC_ChEnable                (DMA_ADC_ChannelEnable)
#define DMA_ADC_ChDisable               (DMA_ADC_ChannelDisable)
#define DMA_ADC_SetDataElementSize      (DMA_ADC_SetDataSize)
#define DMA_ADC_GetDataElementSize      (DMA_ADC_GetDataSize)
#define DMA_ADC_SetXloopNumDataElements (DMA_ADC_SetXloopDataCount)
#define DMA_ADC_GetXloopNumDataElements (DMA_ADC_GetXloopDataCount)
#define DMA_ADC_SetYloopNumDataElements (DMA_ADC_SetYloopDataCount)
#define DMA_ADC_GetYloopNumDataElements (DMA_ADC_GetYloopDataCount)
#define DMA_ADC_SetInterruptMask()      (DMA_ADC_SetInterruptMask(DMA_ADC_INTR_MASK))
#define DMA_ADC_GetInterruptCause       (DMA_ADC_GetStatus)

#define DMA_ADC_PREEMTAMBLE             (DMA_ADC_PREEMPTABLE)
/*******************************************************************************
* Function Name: DMA_ADC_SetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE void DMA_ADC_SetSrcDstTransferWidth(cy_stc_dma_descriptor_t * descriptor, uint32_t options)
{
    uint32_t ctlRegVal = descriptor->ctl & ((uint32_t)~(DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | \
            DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
    
    descriptor->ctl = ctlRegVal |
        ((options << DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos) &
        (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
}


/*******************************************************************************
* Function Name: DMA_1_GetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_ADC_GetSrcDstTransferWidth(cy_stc_dma_descriptor_t const * descriptor)
{
    uint32_t ctlRegVal = descriptor->ctl & (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk |
        DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk);
    
    return(ctlRegVal >> DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos);
}

#endif /* CY_DMA_BWC */


#if defined(__cplusplus)
}
#endif

#endif/* (DMA_ADC_CH_H) */

/* [] END OF FILE */
